In [86]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sklearn as sk
df = pd.read_csv('titanic_train.csv', index_col=0)

In [87]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [88]:
df.drop(['Name', 'Ticket'], axis=1, inplace=True)

In [89]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
PassengerId,,,,,,,,,
1,0,3,male,22.0,1,0,7.2500,NaN,S
2,1,1,female,38.0,1,0,71.2833,C85,C
3,1,3,female,26.0,0,0,7.9250,NaN,S
4,1,1,female,35.0,1,0,53.1000,C123,S
5,0,3,male,35.0,0,0,8.0500,NaN,S

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Cabin     204 non-null    object
 8   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 69.6+ KB

In [91]:
df = pd.get_dummies(df, columns=['Sex'], drop_first=True, )

In [92]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Cabin,Embarked,Sex_male
PassengerId,,,,,,,,,
1,0,3,22.0,1,0,7.2500,NaN,S,1
2,1,1,38.0,1,0,71.2833,C85,C,0
3,1,3,26.0,0,0,7.9250,NaN,S,0
4,1,1,35.0,1,0,53.1000,C123,S,0
5,0,3,35.0,0,0,8.0500,NaN,S,1

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Cabin     204 non-null    object
 7   Embarked  889 non-null    object
 8   Sex_male  891 non-null    uint8
dtypes: float64(2), int64(4), object(2), uint8(1)
memory usage: 63.5+ KB

In [94]:
def percent_nan(df):
    percent_nan = df.isnull().sum() / len(df) * 100
    percent_nan = percent_nan[percent_nan > 0].sort_values(ascending=False)
    return percent_nan

In [95]:
percent_nan(df)

Cabin       77.104377
Age         19.865320
Embarked     0.224467
dtype: float64

In [96]:
df.drop(['Cabin'], axis=1, inplace=True)

In [97]:
nan_embarked_index = df[df['Embarked'].isnull()].index

In [98]:
df.drop(nan_embarked_index, axis=0, inplace=True)

In [99]:
df['Embarked'].groupby(df['Embarked']).count()

Embarked
C    168
Q     77
S    644
Name: Embarked, dtype: int64

In [100]:
df = pd.get_dummies(df, columns=['Embarked'])

In [101]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
1,0,3,22.0,1,0,7.2500,1,0,0,1
2,1,1,38.0,1,0,71.2833,0,1,0,0
3,1,3,26.0,0,0,7.9250,0,0,0,1
4,1,1,35.0,1,0,53.1000,0,0,0,1
5,0,3,35.0,0,0,8.0500,1,0,0,1

In [102]:
corr = df.corr ()
corr['Age'].sort_values(ascending=False)

Age           1.000000
Sex_male      0.099037
Fare          0.093143
Embarked_C    0.038268
Embarked_Q   -0.021693
Embarked_S   -0.025431
Survived     -0.082446
Parch        -0.187896
SibSp        -0.307351
Pclass       -0.365902
Name: Age, dtype: float64

In [103]:
# from sklearn.model_selection import train_test_split
# X = df.drop('Survived', axis=1)
# y = df['Survived']
# X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)
# from sklearn.ensemble import RandomForestClassifier
# model = RandomForestClassifier(n_estimators=10,max_features='auto')
# model.fit(X_train,y_train)
# preds = model.predict(X_test)
# from sklearn.metrics import mean_absolute_error
# rf_val_mae = mean_absolute_error(preds, y_test)

In [104]:
age_df = df[df['Age'].notnull()]

In [105]:
from sklearn.model_selection import train_test_split
X = age_df.drop('Age', axis=1)
y = age_df['Age']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

In [109]:
from sklearn.ensemble import RandomForestClassifier

In [110]:
model = RandomForestClassifier(n_estimators=10,max_features='auto')

In [111]:
model.fit(X_train,y_train)

ValueError: Unknown label type: 'continuous'

In [ ]:
preds = model.predict(X_test)

In [ ]:
df['Age'].fillna(value = df['Age'].mean(), inplace=True)

In [ ]:
percent_nan(df)

Series([], dtype: float64)

In [ ]:
df.to_csv('titanic_cleaned.csv')

In [ ]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
1,0,3,22.0,1,0,7.2500,1,0,0,1
2,1,1,38.0,1,0,71.2833,0,1,0,0
3,1,3,26.0,0,0,7.9250,0,0,0,1
4,1,1,35.0,1,0,53.1000,0,0,0,1
5,0,3,35.0,0,0,8.0500,1,0,0,1